Revit 2026 API

# ViewScheduleExportOptionsFieldDelimiter Property

---

How to delimit fields. Default is Tab.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string FieldDelimiter { get; set; }
```
```vb
Public Property FieldDelimiter As String
	Get
	Set
```
```cpp
public:
property String^ FieldDelimiter {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member FieldDelimiter : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

ViewScheduleExportOptions Class

Autodesk.Revit.DB Namespace